# pandas

* In Python, pandas is a powerful open-source data analysis and manipulation library. It provides data structures and functions that simplify working with structured data, such as tabular data (like spreadsheets or SQL tables). Pandas is particularly useful for tasks like data cleaning, transformation, exploration, and analysis. It's built on top of NumPy, another popular Python library for numerical computing, and it offers DataFrame objects, which are similar to tables in a database or Excel spreadsheet, along with Series objects for handling one-dimensional data. Overall, pandas is widely used in data science, machine learning, and data analysis projects due to its efficiency and ease of use.

* pandas have 2 type of data structure :

          1. Series :  It's one dimension array with indexes and capable of holding any type of data ; store data in single column or row
          2. DataFrame :  It's tebular representation ..ie .. row and columns and potentially store different type of data

* In easy to understand , if I have a data in tabular form then entire table is 'DataFrame' , wherease each column is 'Series'

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
dict1 = {
    "name" : ["Aman","Rishabh","zishan","vishal"],
    "marks" : [55,36,88,45],
    "city" : ["pune","delhi","agra","ara"]
}
df =pd.DataFrame(dict1) # in sheet or table like strucutre
print(df)

In [ ]:
df.to_csv('friends.csv') # excel sheet of above data will be downloaded

In [ ]:
df.to_csv('frends_withoutIndex.csv', index=False) # no index

In [ ]:
df.head(2)  # from above to display . used in large data

In [ ]:
df.tail(2)  # from bottom. used in large data

In [ ]:
df.describe() # for numeric columns it gives following

In [ ]:
golu = pd.read_csv('golu.csv')
print(golu)

In [ ]:
golu['cities']  # give list of column

In [ ]:
golu['times_visited'][2] = 1 # update agra visit to 1
print(golu)  # let's check update
golu.to_csv('golu.csv') # value will be update
# here I take data from csv file and did some operations and again save

In [ ]:
golu.index = ["1st","2nd","3rd","4th"] # change indexing
print(golu)

In [ ]:
ser = pd.Series(np.random.rand(34))  # 34 columns with random values
print(ser)
print(type(ser))  # it will show series

In [ ]:
newdf = pd.DataFrame(np.random.rand(321,10),index= np.arange(321))
newdf.head() # for 5 from top
newdf # for all
type(newdf)  # output : pandas.core.frame.DataFrame
newdf.describe()

In [ ]:
newdf.index # all indexes
newdf.columns # OUTPUT : RangeIndex(start=0, stop=10, step=1)
newdf.sort_index(axis=0,ascending=False) # we can change order
newdf.sort_index(axis=1,ascending=False) # to sort column

In [ ]:
num = newdf.to_numpy()
num

In [ ]:
newdf.T # getting transpose of matrix

In [ ]:
newdf[0]
type(newdf[0]) # series

In [ ]:
newdf2 = newdf
newdf2[0][0]=8999
newdf     # above view is created . so if you change in newdf2 then values of newdf will also be changed

In [ ]:
newdf3 = newdf.copy() # here copy created 
newdf3[0][0]=1212
newdf    # change in newdf3 will not change in newdf

In [ ]:
newdf.loc[0][0] = 1  # best way to update
newdf.head(2)

In [ ]:
newdf.drop(5, axis=1) # column name with 5 will be deleted

In [ ]:
newdf.columns= list("ABCDEFGHIJ")  # changing columns
newdf.head(2)
newdf.drop(['E','F','G','H','I','J'],axis=1) # delete multiple columns
short = newdf.loc[[1,2,3],['C','D']]  # get specific rows and columns and store
newdf.loc[[1,2],:]  # specific rows but all columns

In [ ]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]  # it will those data who match given conditions

In [ ]:
newdf.iloc[0,4]   # iloc works as indexing like in matrix system wherease loc work according to name of rows and columns
newdf.iloc[[0,1],[5,2]]

In [ ]:
newdf.drop([3]) # deleting rows
newdf = newdf.drop([5,6,7]) # actual data will be changed
newdf

In [85]:
newdf.drop(['B','D'],axis=1, inplace=True) # it will also change origional data
newdf.head(3)

          C         E         F         G         H         I         J
3  0.883073  0.038829  0.608673  0.392078  0.344019  0.212547  0.239365
4  0.460945  0.901040  0.767838  0.530728  0.390078  0.022967  0.069691
9  0.163455  0.792337  0.312792  0.484542  0.567314  0.399701  0.638447

In [88]:
newdf.reset_index() # rearrange index after deleting rows but it will add extra column index
newdf.reset_index(drop=True) # this will not add extra index column
newdf.head(3)

          C         E         F         G         H         I         J
3  0.883073  0.038829  0.608673  0.392078  0.344019  0.212547  0.239365
4  0.460945  0.901040  0.767838  0.530728  0.390078  0.022967  0.069691
9  0.163455  0.792337  0.312792  0.484542  0.567314  0.399701  0.638447

In [89]:
newdf['E'].isnull()  # return boolean for all rows

3      False
4      False
9      False
10     False
11     False
       ...
316    False
317    False
318    False
319    False
320    False
Name: E, Length: 314, dtype: bool

In [92]:
newdf['E'] = None  # set all E as none
newdf
newdf['E'].isnull()   # now it will give true

3      True
4      True
9      True
10     True
11     True
       ...
316    True
317    True
318    True
319    True
320    True
Name: E, Length: 314, dtype: bool

In [94]:
newdf.loc[:,['E']] = 55  # loc is the better way to update
newdf

            C   E         F         G         H         I         J   B
3    0.883073  55  0.608673  0.392078  0.344019  0.212547  0.239365  55
4    0.460945  55  0.767838  0.530728  0.390078  0.022967  0.069691  55
9    0.163455  55  0.312792  0.484542  0.567314  0.399701  0.638447  55
10   0.662038  55  0.797136  0.110605  0.624113  0.215261  0.907962  55
11   0.762743  55  0.075870  0.842896  0.776503  0.238678  0.545212  55
..        ...  ..       ...       ...       ...       ...       ...  ..
316  0.198143  55  0.834268  0.586076  0.774410  0.543846  0.988820  55
317  0.627221  55  0.021080  0.471327  0.693525  0.915632  0.981145  55
318  0.236349  55  0.555437  0.027852  0.871600  0.815826  0.154134  55
319  0.346831  55  0.195754  0.448333  0.495176  0.956953  0.554416  55
320  0.449640  55  0.576854  0.137856  0.773864  0.749485  0.906485  55

[314 rows x 8 columns]

In [96]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})
df.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [102]:
df.dropna() # to drop na values
# df = df.dropna() # to change in origional data
df

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [101]:
df.dropna(axis='columns')

     name        toy       born
1  Batman  Batmobile 1940-04-25